# home work 2_4_Lykhovyd,
# Завдання 4
#
# Напишіть програму, в якій користувач вводить фразу з клавіатури. На екрані виведіть суму ASCII-кодів символів введеного рядка.


# Я не зміг вирішити цю задачу. Мені здається, що варто організувати цикл з підрахунку суми, але на заняттях ми цього ще не вчили.
# Тому прошу допомоги у розв'язанні цієї задачі. Внизу наведено невдалі спроби вирішення на які можете не зважати.

string=str(input("Введіть фразу:"))

print("Сума ASCII-кодів вашої фрази становить", sum(ord(string)))
