# home work 2_3_Lykhovyd,
# Завдання 3
#
# Напишіть програму, яка розв'язує квадратне рівняння 𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0 за формулами 𝑥1,2 = (−b±b2−4ac−−−−−−−√)/2a .
# Значення a, b та c вводяться з клавіатури. Для знаходження кореня використовуйте оператор зведення в ступінь,
# а не функцію math.sqrt, щоб отримати комплексні числа у випадку, якщо вираз під коренем негативний.

a=int(input("Введіть коефіцієнт а квадратного рівняння (𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0):"))
b=int(input("Введіть коефіцієнт b квадратного рівняння (𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0):"))
c=int(input("Введіть коефіцієнт c квадратного рівняння (𝑎𝑥 2 + 𝑏𝑥 + 𝑐 = 0):"))
x1=(-b+(2*b-4*a*c)**1/2)/(2*a)
x2=(-b-(2*b-4*a*c)**1/2)/(2*a)
print("перший корінь рівняння:",x1)
print("другий корінь рівняння:",x2)
